Revit 2024 API
ViewSheet.CanBeDuplicated Method
 Identifies if this sheet can be duplicated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public bool CanBeDuplicated(
	SheetDuplicateOption duplicateOption
)
Visual Basic
Public Function CanBeDuplicated ( _
	duplicateOption As SheetDuplicateOption _
) As Boolean
Visual C++
public:
bool CanBeDuplicated(
	SheetDuplicateOption duplicateOption
)
Parameters
duplicateOption
Type: Autodesk.Revit.DB.SheetDuplicateOption
 The option to use when duplicating the sheet.
Return Value
 True if the sheet can be duplicated, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ViewSheet Class
Autodesk.Revit.DB Namespace